# CreateChainDimension

## Description
Creates and returns a single chain dimension object when the two dimensions or chains that are passed in meet the requirements for being in a single chain dimension object.

```pascal
FUNCTION CreateChainDimension(
				h1 : HANDLE;
				h2 : HANDLE) : HANDLE;
```

```python

def vs.CreateChainDimension(h1, h2):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h1|HANDLE||
|h2|HANDLE||

## Version
Availability: from VectorWorks12.5
## Category
* Dimensions